---
kind: property
id: P:Autodesk.Revit.DB.MultiReferenceAnnotationOptions.TagHasLeader
source: html/f2229df0-e357-4462-a700-6d1be4397e1c.htm
---
# Autodesk.Revit.DB.MultiReferenceAnnotationOptions.TagHasLeader Property

When true the tag will be created with an attached leader.
 When false the tag will be created without a leader.

## Syntax (C#)
```csharp
public bool TagHasLeader { get; set; }
```